www/app/controllers/paypals_controller.rb

SELECT "paypals".* FROM "paypals" WHERE "paypals"."id" = 3 LIMIT 1
---
  def show
    pp = Paypal.find_by_id params[:id]