www/app/controllers/rooms_controller.rb

INSERT INTO "rooms" ("created_at", "rules", "state", "updated_at") VALUES ('2015-04-07 15:53:10.392000', '{"game":"team fortress 2","map":"ctf_2fort","playercount":16,"wager":20}', 1, '2015-04-07 15:53:10.392000')
---
  def create
    @room = Room.new(room_params)

    respond_to do |format|
      if @room.save