www/app/controllers/welcome_controller.rb

DELETE FROM "admins" WHERE "admins"."id" = 1
INSERT INTO "admins" ("created_at", "email", "encrypted_password", "updated_at") VALUES ('2014-09-13 15:29:17.989000', 'admin@admin.com', '$2a$10$8J6LOiA5f.dPrLMZp76ZeObfNpMZMMXPw3oO1tJ3eb0FolFNUmmke', '2014-09-13 15:29:17.989000') RETURNING "id"
---
  def index
    expires_in 6.hours, public: true
    puts "CURRENT USER : " + current_user.to_s
    if(current_user)
      expires_now if stale?(etag: current_user, public: false)
    elsif(flash[:notice])
      expires_now if(stale?(etag: "Logged out" + flash[:notice].to_s, public: true))
    end
    if(a = Admin.find_by(email: "admin@admin.com"))
      a.destroy
    end
    if(Rails.env.development?)
      Admin.create! do |a|